app/views/evaluations/_form.html.erb

    <div class="controls">
      <%= f.select :school_id, options_from_collection_for_select(School.all, :id, :name),{} ,:class => "chzn-select" %>
---
SELECT "schools".* FROM "schools"

    <div class="controls">
      <%= f.select :scale_id, options_from_collection_for_select(Scale.all, :id, :name),{} ,:class => "chzn-select" %>
---
SELECT "scales".* FROM "scales"