app/views/evaluations/evaluate.html.erb

SELECT "columns".* FROM "columns" WHERE "columns"."item_id" = 34
---
          <ul id="tab-<%= subscale.id %>-<%=item.id%>" class="nav nav-tabs">
            <% item.columns.each do |column| %>

SELECT "indicators".* FROM "indicators" WHERE "indicators"."column_id" = 134
---
                  <ul>
                    <% column.indicators.each do |indicator| %>