app/views/evaluations/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]
---
      <tr>
        <td><%= User.find(evaluation.user_id).name %></td>
        <td><%= School.find(evaluation.school_id).name %></td>