app/controllers/evaluations_controller.rb

SELECT "evaluations".* FROM "evaluations"
---
  def index
    @evaluations = Evaluation.all

SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @evaluation = Evaluation.find(params[:id])

SELECT "scales".* FROM "scales"
SELECT "schools".* FROM "schools"
---
  def new
    @evaluation = Evaluation.new
    @scales = Scale.all
    @schools = School.all

INSERT INTO "evaluations" ("cognitive_disability", "created_at", "evaluation_date", "finish_time", "max_birth_date", "max_number_kids", "min_birth_date", "number_kids", "number_kids_disability", "other_disability", "personal_members_present", "physical_disability", "room", "scale_id", "school_id", "social_disability", "start_time", "total_score", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @evaluation = Evaluation.new(params[:evaluation])
    @evaluation.start_time = Time.now
    @evaluation.user = current_user

    respond_to do |format|
      if @evaluation.save

SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "subscales".* FROM "subscales" WHERE "subscales"."scale_id" = 1
---
  def evaluate
    @evaluation = Evaluation.find(params[:id])
    #@evaluation = Evaluation.create(:school_id => params[:school][:school_id], :user_id => current_user.id)

    @subscales = Subscale.where(:scale_id => @evaluation.scale_id)

SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "evaluations" SET "finish_time" = '2013-12-08 16:06:46.813266', "updated_at" = '2013-12-08 16:06:46.814311' WHERE "evaluations"."id" = 2
INSERT INTO "scores" ("created_at", "evaluation_id", "indicator_id", "updated_at", "value") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 08 Dec 2013 16:06:46 UTC +00:00], ["evaluation_id", 2], ["indicator_id", 1], ["updated_at", Sun, 08 Dec 2013 16:06:46 UTC +00:00], ["value", false]]
---
  def receive
    evaluation = Evaluation.find(params[:evaluation_id])
    evaluation.finish_time = Time.now
    evaluation.save
    if not params[:evaluation].nil?
      params[:evaluation].each do |indicator|
        Score.create(:evaluation_id => evaluation.id, :indicator_id => indicator[0],
          :value => indicator[1])

SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."school_id" = 1
SELECT "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "item_evaluations" ("created_at", "evaluation_id", "item_id", "item_score", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 08 Dec 2013 16:14:21 UTC +00:00], ["evaluation_id", 3], ["item_id", 40], ["item_score", 0], ["updated_at", Sun, 08 Dec 2013 16:14:21 UTC +00:00]]
SELECT "scales".* FROM "scales" WHERE "scales"."id" = ? LIMIT 1  [["id", 2]]
SELECT "subscales".* FROM "subscales" WHERE (name LIKE '%espacio y mueble%') LIMIT 1
---
  def generate_inform
    evaluation = Evaluation.find(params[:id])
    school = School.find(evaluation.school_id)
    month = t("month_names")[evaluation.created_at.month]
    year = evaluation.created_at.year
    scale = Scale.find(evaluation.scale_id)
    subscales = scale.subscales
    subscales_scores = []
    subscales.each do |subscale|